Project/Toir/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/торо_НарядНаВыполнениеРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  <basedOn>Document.торо_ЗаявкаНаРемонт</basedOn>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВыполняемыеРемонтныеРаботы</registerRecords>
  <registerRecords>AccumulationRegister.торо_ПроцентВыполненныхРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>AccumulationRegister.торо_ЗапланированныеРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_НарядыПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявокУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовНарядовНаРемонтныеРаботыУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовНарядовНаРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявок</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_РежимРаботы</name>
    <type>
      <types>EnumRef.гкс_РежимРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОсобыеУсловия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОформитьНарядДопуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОпаснаяРабота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПроведенияРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорБригада</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.торо_РемонтныеБригады</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Огневая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ПовКоэф</name>
      <type>
        <types>CatalogRef.гкс_ПКоэффициентыРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрываемыеПредписания</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзДокументаОснования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВнешнегоОснования</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_СотрудникКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПодрядчики</name>
    <comment>Заменена на ТЧ ИсполнителиПоРемонтам</comment>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственноеЛицо</name>
      <type>
        <types>EnumRef.торо_ОтветственныеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсполнителиПоРемонтам</name>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>УточнениеИсполнителя</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.торо_РемонтныеБригады</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_МПОБДо</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_МПОБВоВремя</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт; // Содержит структуру данных о статусе документа (Начальный, СогласованиеЗавершено, ПроводитьДокумент, ШаблонСообщенияЭлектроннойПочты) 
										// из регистра сведений торо_МатрицаПереходаСтатусовДокументов. 
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
// Процедура - обработчик события "ОбработкаЗаполнения".
// 
Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
			
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(Основание, ЭтотОбъект);	
	
		// Вызывается из формы операций без нарядов, актуально для опасных работ.
		
		Для каждого Строка Из Основание.РемонтыОборудования Цикл
			НС = РемонтыОборудования.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Строка);
			НС.ВидРемонтныхРабот = Строка.ВидРемонта;
			НС.ДокументИсточник = Основание.Основание;
			НС.ДатаНачала = Строка.ДатаНачалаРемонта;
			НС.ДатаОкончания = Строка.ДатаОкончанияРемонта;
		КонецЦикла; 
		
		Если Основание.Свойство("ИзНормативов") И Основание.ИзНормативов = Истина Тогда
			торо_Ремонты.ЗаполнитьРемонтныеРаботыПоНормативам(ЭтотОбъект, "РемонтыОборудования", "РемонтныеРаботы");
		Иначе
			Для каждого Стр Из Основание.МассивРемонтов Цикл
				НС = РемонтныеРаботы.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Стр);
			КонецЦикла;
		КонецЕсли; 
		
		Если Основание.Свойство("ОпасныеРаботы") И Основание.ОпасныеРаботы = Истина Тогда
			ВыводФормыПодбораПриОткрытии = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Основание) = Тип("Соответствие") Тогда
		
		торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(Основание, ЭтотОбъект);	
		торо_ЗаполнениеДокументов20.ЗаполнитьДокументНаОсновании(Основание, ЭтотОбъект);
		
	ИначеЕсли Основание <> Неопределено Тогда
		
		Отказ = Ложь;
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Основание, Отказ, Ложь);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(Основание, ЭтотОбъект);	
		
		ИмяТЧ = торо_Ремонты.ПолучитьИмяТЧРемонтов(Основание);
		
		Неотмененный = торо_ЗаполнениеДокументов.ВернутьIDНеотмененногоРемонта(Основание, Основание[ИмяТЧ]);
		Если ИмяТЧ <> Неопределено И Неотмененный <> "" Тогда
			СоответствиеИДДокументам = Новый Соответствие;
			СоответствиеИДДокументам.Вставить(Неотмененный, Основание);   
			торо_ЗаполнениеДокументов20.ЗаполнитьДокументНаОсновании(СоответствиеИДДокументам, ЭтотОбъект);
		Иначе
			торо_ЗаполнениеДокументов20.ЗаполнитьДокументыОснования(Основание, ЭтотОбъект);
		КонецЕсли; 
	Иначе
		торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(Основание, ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	
	Если РемонтныеРаботы.Количество() > 0 Тогда
		Если Не ЗначениеЗаполнено(РемонтныеРаботы[0].ID) Тогда
			РемонтныеРаботы.Очистить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ФоИнтеграцияСПромБезопасностью = ПолучитьФункциональнуюОпцию("торо_ИнтеграцияСПромБезопасностью");
	ЕстьОпасныеРаботы = Ложь;
	Если ФоИнтеграцияСПромБезопасностью = Истина Тогда
		Для каждого текСтрока из РемонтыОборудования Цикл
			Если текСтрока.ОпаснаяРабота Тогда
				ЕстьОпасныеРаботы = Истина;
				Если Не ЗначениеЗаполнено(текСтрока.МестоПроведенияРабот) Тогда
					ШаблонСообщения = НСтр("es='En la parte tabular ""los Trabajos de reparación"" en la línea № %1 no es rellenado el campo ""el Lugar de la realización de los trabajos"", para los trabajos peligrosos este campo debe ser rellenado. La realización del documento era anulada.';ru='В табличной части ""Ремонтные работы"" в строке №%1 не заполнено поле ""Место проведения работ"", для опасных работ это поле должно быть заполнено. Проведение документа было отменено.';en='In the tabular part ""Repair work"" in line No.%1 the field ""Work Location"" is not filled, for hazardous work this field must be filled. The document has been canceled.'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, текСтрока.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		масРолей = Новый Массив;

		Если ЕстьОпасныеРаботы Тогда
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.Допускающий);
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.ОтветственныйЗаПодготовкуОбъекта);
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.РуководительРабот);
		Иначе
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.Допускающий);
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.ОтветственныйЗаПодготовкуОбъекта);
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.Наблюдающий);
		КонецЕсли;
		
		ЕстьВсеНужныеРоли = ПроверитьНаличиеНеобходимыхРолей(масРолей, Ответственные, ЕстьОпасныеРаботы);
		
		Если НЕ ЕстьВсеНужныеРоли Тогда 
			Отказ = Истина;
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Ответственные.Сотрудник");
		МассивНепроверяемыхРеквизитов.Добавить("Ответственные.ОтветственноеЛицо");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	ПроверитьДублиИсполнителей(Отказ);
	
	СписокТЧ = Новый Структура();
	СписокТЧ.Вставить("РемонтыОборудования", "Ремонты оборудования");
	СписокТЧ.Вставить("РемонтныеРаботы", "Ремонтные работы");
	
	ШаблонСообщения = НСтр("es='En la parte tabular ""%1"" no hay líneas.';ru='В табличной части ""%1"" нет строк.';en='There are no rows in the table part ""%1"".'");
	Для каждого текТЧ из СписокТЧ Цикл
		Если ЭтотОбъект[ТекТЧ.Ключ].Количество() = 0 Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекТЧ.Значение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
	// Проверить заполнение ТЧ
	ПроверитьЗаполнениеТабличнойЧастиРемонтыОборудования(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиРемонтныеРаботы(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	МассивДокументовОснований = ОбщегоНазначения.ВыгрузитьКолонку(ДокументыОснования, "ДокументОснование");
	
	Запрос = Новый Запрос( "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                       |	торо_ВнешнееОснованиеДляРабот.Ссылка КАК Ссылка,
	                       |	торо_ВнешнееОснованиеДляРабот.Проведен КАК Проведен
	                       |ИЗ
	                       |	Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРабот
	                       |ГДЕ
	                       |	торо_ВнешнееОснованиеДляРабот.Ссылка В(&МассивДокОсн)
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	торо_ВыявленныеДефекты.Ссылка,
	                       |	торо_ВыявленныеДефекты.Проведен
	                       |ИЗ
	                       |	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	                       |ГДЕ
	                       |	торо_ВыявленныеДефекты.Ссылка В(&МассивДокОсн)
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	торо_ЗаявкаНаРемонт.Ссылка,
	                       |	торо_ЗаявкаНаРемонт.Проведен
	                       |ИЗ
	                       |	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	                       |ГДЕ
	                       |	торо_ЗаявкаНаРемонт.Ссылка В(&МассивДокОсн)
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	торо_ПланГрафикРемонта.Ссылка,
	                       |	торо_ПланГрафикРемонта.Проведен
	                       |ИЗ
	                       |	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	                       |ГДЕ
	                       |	торо_ПланГрафикРемонта.Ссылка В(&МассивДокОсн)");
	
	Запрос.УстановитьПараметр("МассивДокОсн", МассивДокументовОснований); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.Проведен Тогда
			ТекстСообщения = НСтр("ru = 'Есть непроведенный документ основание: " + Строка(Выборка.Ссылка) + "'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;		
	КонецЦикла;	
	
	УстановитьУправляемыеБлокировки();
	
	ШаблонСообщения = НСтр("es='Para el objeto de la reparación ""%1"" con el tipo de la reparación ""%2"" faltan las líneas en el árbol de los trabajos de reparación.';ru='Для объекта ремонта ""%1"" с видом ремонта ""%2"" отсутствуют строки в дереве ремонтных работ.';en='For repair object ""%1"" with repair type ""%2"", there are no lines in the repair tree.'");
	Для Каждого СтрокаСРемонтом Из РемонтыОборудования Цикл
		МассивСтрок = РемонтныеРаботы.НайтиСтроки(Новый структура("РемонтыОборудования_ID", СтрокаСРемонтом.ID));
		Если МассивСтрок.Количество() = 0 Тогда			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаСРемонтом.ОбъектРемонта, СтрокаСРемонтом.ВидРемонтныхРабот);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;			
		КонецЕсли;
	КонецЦикла;
	
	Если ДокументыОснования.Количество()>0 Тогда
		ПроверитьДатуДокумента(Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, Отказ);
	КонецЕсли;
	
	Движения.торо_СтатусыДокументовНарядовНаРемонтныеРаботы.Записывать = Истина;
	торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусДокумента(Ссылка, Ссылка, Движения, Перечисления.торо_СтатусыДокументов.Зарегистрирован);
	торо_РаботаСоСтатусамиДокументовСервер.ИзменитьСтатусыДокументовОснований(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	МассивIDДляБлокировки = торо_Ремонты.МассивIDДляБлокировкиРемонтовОборудования(Ссылка, РемонтыОборудования.ВыгрузитьКолонку("ID"));
	Если МассивIDДляБлокировки <> Неопределено И МассивIDДляБлокировки.Количество() > 0 Тогда
		ТекстСообщения = НСтр("es='¡Es imposible anular la realización del documento, puesto que hay unos documentos pasados, creados a razón sus!';ru='Невозможно отменить проведение документа, так как имеются созданные на его основании проведенные документы!';en='Unable to cancel the document, since there are created documents based on it!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		торо_РаботаСоСтатусамиДокументовСервер.ОтменаПроведения(Ссылка);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ПроверитьДатуДокумента(Отказ)
	
	МассивДокументовОснований = ОбщегоНазначения.ВыгрузитьКолонку(ДокументыОснования, "ДокументОснование");
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	торо_ВнешнееОснованиеДляРабот.Дата КАК Дата
	                      |ИЗ
	                      |	Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРабот
	                      |ГДЕ
	                      |	торо_ВнешнееОснованиеДляРабот.Ссылка В(&МассивДокОсн)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	торо_ВыявленныеДефекты.Дата
	                      |ИЗ
	                      |	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	                      |ГДЕ
	                      |	торо_ВыявленныеДефекты.Ссылка В(&МассивДокОсн)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	торо_ЗаявкаНаРемонт.Дата
	                      |ИЗ
	                      |	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	                      |ГДЕ
	                      |	торо_ЗаявкаНаРемонт.Ссылка В(&МассивДокОсн)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	торо_ПланГрафикРемонта.Дата
	                      |ИЗ
	                      |	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	                      |ГДЕ
	                      |	торо_ПланГрафикРемонта.Ссылка В(&МассивДокОсн)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Дата УБЫВ");
	Запрос.УстановитьПараметр("МассивДокОсн", МассивДокументовОснований);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Дата <= Выборка.Дата Тогда
			ТекстСообщения = НСтр("es='¡La fecha del documento debe ser más de fechas del documento-razón!';ru='Дата документа должна быть больше даты документа-основания!';en='The date of the document must be greater than the date of the base document!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "РемонтыОборудования".
//
// Параметры:
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиРемонтыОборудования(Отказ)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ОбъектРемонта,ВидРемонтныхРабот,ДатаНачала");
	
	// Вызовем общую процедуру проверки.
	торо_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "РемонтыОборудования", СтруктураОбязательныхПолей, Отказ, "");
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "РемонтныеРаботы".
//
// Параметры:
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиРемонтныеРаботы(Отказ)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("РемонтнаяРабота,РемонтыОборудования_ID");
	
	// Вызовем общую процедуру проверки.
	торо_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "РемонтныеРаботы", СтруктураОбязательныхПолей, Отказ, "");
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(РежимПроведения, Отказ)
	
	ДвиженияПоРегистру_торо_Ремонты(РежимПроведения, Отказ);
	
	ДвиженияПоРегистру_торо_НарядыПоРемонтам(РежимПроведения, Отказ);
	
	ТабРемРаб = ПодготовитьТаблицуПроведенияРемонтныхРабот();
	
	ТаблицаРемонтовОборудования = ПолучитьТаблицуРемонтовОборудования();
	
	РемонтыСЗаявками = ТаблицаРемонтовОборудования.Скопировать(Новый Структура("ЕстьЗаявка", Истина));
	РемонтыБезЗаявок = ТаблицаРемонтовОборудования.Скопировать(Новый Структура("ЕстьЗаявка", Ложь));
	
	ТаблицаНеУчтенныхРабот = ТабНеУчтенныхРабот(ТабРемРаб, РемонтыСЗаявками.ВыгрузитьКолонку("ID"));
	ТаблицаРаботБезЗаявок = ПолучитьТаблицуРемонтныхРаботБезЗаявок(ТабРемРаб, РемонтыБезЗаявок.ВыгрузитьКолонку("ID"));
	
	ДвиженияПоРегистру_торо_ВыполняемыеРемонтныеРаботы(ТабРемРаб, РежимПроведения, Отказ);
	
	ДвиженияПоРегистру_торо_ЗапланированныеРемонтныеРаботы(ТаблицаНеУчтенныхРабот, ТаблицаРаботБезЗаявок, РежимПроведения, Отказ);
	
	ТаблицаВО = СформироватьТаблицуВнешнихОснований();
	ДвиженияПоРегистру_торо_ВнешниеОснованияДляРабот(РежимПроведения, ТаблицаВО, Отказ);
	
	ДвиженияПоРегистру_торо_ПроцентВыполненныхРабот(ТабРемРаб, РежимПроведения, Отказ);
	
КонецПроцедуры

Процедура ДвиженияПоРегистру_торо_ПроцентВыполненныхРабот(ТаблицаРемонтныхРабот, РежимПроведения, Отказ)
	
	Движения.торо_ПроцентВыполненныхРабот.Записывать = Истина;
	
	Для каждого Стр Из ТаблицаРемонтныхРабот Цикл
		Если ТипЗнч(Стр.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда	
			Движение = Движения.торо_ПроцентВыполненныхРабот.Добавить();
			Движение.Период = Дата;
			Движение.IDРемонта = Стр.IDРемонта;
			Движение.IDОперации = Стр.ID;
			Движение.Операция = Стр.РемонтнаяРабота;
			Движение.IDРодителя = Стр.Родитель_ID;
			Движение.Процент = Стр.Количество * 100;
			Движение.ВидДокумента = Перечисления.торо_ВидДокумента.НарядНаВыполнениеРемонтныхРабот;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьТаблицуРемонтныхРаботБезЗаявок(ТабРемРаб, МассивID)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.РемонтнаяРабота,
	|	Таб.IDРемонта,
	|	Таб.ID КАК IDОперации,
	|	Таб.Родитель_ID,
	|	Таб.Количество
	|ПОМЕСТИТЬ ТабРемонтныхРабот
	|ИЗ
	|	&Таб КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРемонтныхРабот.РемонтнаяРабота,
	|	ТабРемонтныхРабот.IDРемонта,
	|	ТабРемонтныхРабот.IDОперации,
	|	ТабРемонтныхРабот.Родитель_ID,
	|	ТабРемонтныхРабот.Количество
	|ИЗ
	|	ТабРемонтныхРабот КАК ТабРемонтныхРабот
	|ГДЕ
	|	ТабРемонтныхРабот.IDРемонта В (&IDРемонта)";
	
	Запрос.УстановитьПараметр("Таб", ТабРемРаб);
	Запрос.УстановитьПараметр("IDРемонта", МассивID);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуРемонтовОборудования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID
		|ПОМЕСТИТЬ ТабID
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта КАК IDРемонта
		|ПОМЕСТИТЬ ВТ_IDЗаявок
		|ИЗ
		|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
		|			,
		|			IDРемонта В
		|				(ВЫБРАТЬ
		|					Таб.ID
		|				ИЗ
		|					ТабID КАК Таб)) КАК торо_ЗаявкиПоРемонтамСрезПоследних
		|ГДЕ
		|	НЕ торо_ЗаявкиПоРемонтамСрезПоследних.Регистратор В
		|				(ВЫБРАТЬ
		|					торо_ОтмененныеЗаявки.Заявка
		|				ИЗ
		|					РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабID.ID КАК ID,
		|	ВЫБОР
		|		КОГДА торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьЗаявка
		|ИЗ
		|	ТабID КАК ТабID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_IDЗаявок КАК торо_ЗаявкиПоРемонтамСрезПоследних
		|		ПО ТабID.ID = торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ДвиженияПоРегистру_торо_ЗапланированныеРемонтныеРаботы(ТабНеУчтенныхРабот, ТабРаботБезЗаявки, РежимПроведения, Отказ)
	
	Движения.торо_ЗапланированныеРемонтныеРаботы.Записывать = Истина;
	
	Для каждого СтрТаб Из ТабНеУчтенныхРабот Цикл
		
		Движение = Движения.торо_ЗапланированныеРемонтныеРаботы.Добавить();
		Движение.Период = Дата;
		Движение.IDОперации = СтрТаб.IDОперации;
		Движение.IDРемонта = СтрТаб.IDРемонта;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Родитель_ID = СтрТаб.Родитель_ID;
		Движение.ПроцентОпераций = СтрТаб.ПроцентОперацийДок - СтрТаб.ПроцентОпераций;
		
	КонецЦикла;
	
	Для каждого СтрТаб Из ТабРаботБезЗаявки Цикл
		
		Движение = Движения.торо_ЗапланированныеРемонтныеРаботы.Добавить();
		Движение.Период = Дата;
		Движение.IDОперации = СтрТаб.IDОперации;
		Движение.IDРемонта = СтрТаб.IDРемонта;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Родитель_ID = СтрТаб.Родитель_ID;
		Движение.ПроцентОпераций = СтрТаб.Количество * 100;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТабНеУчтенныхРабот(ТабРемРаб, МассивID)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таб.РемонтнаяРабота,
		|	Таб.IDРемонта,
		|	Таб.ID КАК IDОперации,
		|	Таб.Родитель_ID,
		|	Таб.Количество
		|ПОМЕСТИТЬ ТабРемонтныхРабот
		|ИЗ
		|	&Таб КАК Таб
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабРемонтныхРабот.РемонтнаяРабота,
		|	ТабРемонтныхРабот.IDРемонта,
		|	ТабРемонтныхРабот.IDОперации,
		|	ТабРемонтныхРабот.Родитель_ID,
		|	ТабРемонтныхРабот.Количество
		|ИЗ
		|	ТабРемонтныхРабот КАК ТабРемонтныхРабот
		|ГДЕ
		|	ТабРемонтныхРабот.IDРемонта В (&IDРемонта)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабРемонтныхРабот.IDРемонта,
		|	ТабРемонтныхРабот.IDОперации,
		|	ТабРемонтныхРабот.Родитель_ID,
		|	ТабРемонтныхРабот.Количество * 100 КАК ПроцентОперацийДок,
		|	ЕСТЬNULL(торо_ЗапланированныеРемонтныеРаботы.ПроцентОпераций, 0) КАК ПроцентОпераций
		|ИЗ
		|	ТабРемонтныхРабот КАК ТабРемонтныхРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ЗапланированныеРемонтныеРаботы КАК торо_ЗапланированныеРемонтныеРаботы
		|		ПО ТабРемонтныхРабот.IDРемонта = торо_ЗапланированныеРемонтныеРаботы.IDРемонта
		|			И ТабРемонтныхРабот.IDОперации = торо_ЗапланированныеРемонтныеРаботы.IDОперации
		|			И ТабРемонтныхРабот.Родитель_ID = торо_ЗапланированныеРемонтныеРаботы.Родитель_ID
		|			И (ВЫРАЗИТЬ(торо_ЗапланированныеРемонтныеРаботы.Регистратор КАК Документ.торо_ЗаявкаНаРемонт) ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
		|ГДЕ 
		|			торо_ЗапланированныеРемонтныеРаботы.ПроцентОпераций < ТабРемонтныхРабот.Количество * 100";

	Запрос.УстановитьПараметр("Таб", ТабРемРаб);
	Запрос.УстановитьПараметр("IDРемонта", МассивID);
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

Процедура ДвиженияПоРегистру_торо_Ремонты(РежимПроведения, Отказ)
	
	// Движения по регистру сведений торо_Ремонты
	Движения.торо_Ремонты.Записывать = Истина;
	Для Каждого СтрРемонта Из РемонтыОборудования Цикл
		
		Движение = Движения.торо_Ремонты.Добавить();
		Движение.Период 			= МоментВремени().Дата;
		Движение.ID 				= СтрРемонта.ID;
		Движение.ОбъектРемонта 		= СтрРемонта.ОбъектРемонта;
		Движение.ВидРемонта			= СтрРемонта.ВидРемонтныхРабот;
		Движение.ДатаНачалаФакт		= СтрРемонта.ДатаНачала;
		Движение.ДатаОкончанияФакт	= СтрРемонта.ДатаОкончания;
		Движение.ГарантийныйРемонт  = СтрРемонта.ГарантийныйРемонт;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвиженияПоРегистру_торо_НарядыПоРемонтам(РежимПроведения, Отказ)
	
	// Движения по регистру сведений торо_НарядыПоРемонтам
	Движения.торо_НарядыПоРемонтам.Записывать = Истина;
	Для Каждого СтрРемонта Из РемонтыОборудования Цикл
		
		Движение = Движения.торо_НарядыПоРемонтам.Добавить();
		Движение.Период 			= МоментВремени().Дата;
		Движение.IDРемонта			= СтрРемонта.ID;
		
	КонецЦикла;		
	
КонецПроцедуры

Функция ПодготовитьТаблицуПроведенияРемонтныхРабот()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Родитель_ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID КАК IDРемонта,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Количество
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаПроведения = Запрос.Выполнить().Выгрузить();
	
	КЧ = Новый КвалификаторыЧисла(5, 2);
	МассивТипов = Новый Массив(1);
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(МассивТипов, , ,КЧ);
	ТаблицаПроведения.Колонки.Добавить("ПроцентНевыполненныхРабот", ОписаниеТиповЧ);
	
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповД = Новый ОписаниеТипов(МассивТипов, , ,КД);
	ТаблицаПроведения.Колонки.Добавить("ДатаНачалаРемонта", ОписаниеТиповД);
	
	Для каждого Строка Из РемонтыОборудования Цикл
		
		МассивСтрок = ТаблицаПроведения.НайтиСтроки(Новый Структура("IDРемонта",Строка.ID));
		
		Для каждого СтрокаМассива Из МассивСтрок Цикл
			СтрокаМассива.ДатаНачалаРемонта = Строка.ДатаНачала;
		КонецЦикла;
		
	КонецЦикла; 

	торо_Ремонты.ЗаполнитьПроцентыНевыполненныхРаботПоНормамВремени("", ТаблицаПроведения);
	
	РасставитьПроцентНаРодительскихУровнях("", ТаблицаПроведения); 
	
	Возврат ТаблицаПроведения;

КонецФункции

// Процедура устанавливает значение процента на родительских уровнях таблицы ремонтных работ акта.
//
// Параметры:
//  СтрокаДерева – строка дерева значений.
//  Процент      – число – устанавливаемый процент.
//
Процедура РасставитьПроцентНаРодительскихУровнях(ID_Поиска, ТаблицаПроведения)
	
	СуммаСПроцентомВыполнения = 0;
	
	МассивСтрок = ТаблицаПроведения.НайтиСтроки(Новый Структура("Родитель_ID", ID_Поиска));
	
	Для Каждого Элемент Из МассивСтрок Цикл
		
		РасставитьПроцентНаРодительскихУровнях(Элемент.ID, ТаблицаПроведения);
		
		СуммаСПроцентомВыполнения = СуммаСПроцентомВыполнения + Элемент.ПроцентНеВыполненныхРабот;
		
	КонецЦикла;
	
	Если СуммаСПроцентомВыполнения > 0 Тогда
		
		СтрокаТЗ = ТаблицаПроведения.Найти(ID_Поиска, "ID");
		Если Не СтрокаТЗ = Неопределено Тогда
			
			СтрокаТЗ.ПроцентНеВыполненныхРабот = СтрокаТЗ.ПроцентНеВыполненныхРабот * СуммаСПроцентомВыполнения / 100;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // РасставитьПроцентНаНижнихУровнях()

Процедура ДвиженияПоРегистру_торо_ВыполняемыеРемонтныеРаботы(ТабРемРаб, РежимПроведения, Отказ)
	
	Движения.торо_ВыполняемыеРемонтныеРаботы.Записывать = Истина;
	
	Для каждого СтрТаб Из ТабРемРаб Цикл
		
		Движение = Движения.торо_ВыполняемыеРемонтныеРаботы.Добавить();
		Движение.Период = Дата;
		Движение.IDОперации = СтрТаб.ID;
		Движение.IDРемонта = СтрТаб.IDРемонта;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Родитель_ID = СтрТаб.Родитель_ID;
		Движение.РемонтнаяРабота = СтрТаб.РемонтнаяРабота;
		Движение.ПроцентОпераций = СтрТаб.Количество * 100;
		Движение.ПроцентРемонта = СтрТаб.ПроцентНевыполненныхРабот;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьУправляемыеБлокировки()
	
	Блокировка = Новый БлокировкаДанных;
	
	// закрытие предписаний (по таблице ремонты оборудования)
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.торо_ВнешниеОснованияДляРабот");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РемонтыОборудования.Выгрузить(Новый Структура("ЗакрываетПредписание",Истина),"ID");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
	
	// закрытие предписаний (по таблице закрываемых предписаний)
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.торо_ВнешниеОснованияДляРабот");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ЗакрываемыеПредписания.Выгрузить(,"ID");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
	
	// проверяем, есть ли заявка
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.торо_ЗаявкиПоРемонтам");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки.ИсточникДанных = РемонтыОборудования.Выгрузить(,"ID");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("IDРемонта", "ID");
	
	//
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.торо_ЗапланированныеРемонтныеРаботы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РемонтныеРаботы.Выгрузить(,"РемонтыОборудования_ID,ID,Родитель_ID");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("IDРемонта", "РемонтыОборудования_ID");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("IDОперации", "ID");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Родитель_ID", "Родитель_ID");
		
	Блокировка.Заблокировать();
	
КонецПроцедуры

Функция ПроверитьНаличиеНеобходимыхРолей(масРолей, тз, ЕстьОпасныеРаботы)
	
	Результат = Истина;
	
	Для каждого ТекРоль из масРолей Цикл
		
		Если тз.Найти(ТекРоль, "ОтветственноеЛицо") = Неопределено Тогда
			Результат = Ложь;
			Если ЕстьОпасныеРаботы Тогда
				ШаблонСообщения = НСтр("es='En el documento hay unos trabajos peligrosos y en la parte tabular ""los Responsables"" debe ser indicado obligatoriamente ""%1"". La realización del documento era anulada.';ru='В документе присутствуют опасные работы и в табличной части ""Ответственные лица"" обязательно должен быть указан ""%1"". Проведение документа было отменено.';en='The document contains hazardous work and in the tabular part ""Responsible persons"" must be indicated ""%1"". The document has been canceled.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекРоль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Иначе 
				ШаблонСообщения = НСтр("es='En la parte tabular ""los Responsables"" debe ser indicado obligatoriamente ""%1"". La realización del documento era anulada.';ru='В табличной части ""Ответственные лица"" обязательно должен быть указан ""%1"". Проведение документа было отменено.';en='In the table section ""Responsible persons"" must be indicated ""%1"". The document has been canceled.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекРоль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

Функция СформироватьТаблицуВнешнихОснований()

	ТаблицаОснований = ДокументыОснования.Выгрузить();
	ТаблицаПредписаний = ЗакрываемыеПредписания.Выгрузить();
	ТаблицаРемонтовОборудования = РемонтыОборудования.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОснований.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_Основания
	               |ИЗ
	               |	&ТаблицаОснований КАК ТаблицаОснований
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Основания.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_ВнешниеОснованияИзОснований
	               |ИЗ
	               |	ВТ_Основания КАК ВТ_Основания
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ВТ_Основания.ДокументОснование) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаРемонтовОборудования.ID КАК ID
	               |ПОМЕСТИТЬ ВТ_РемонтыОборудования
	               |ИЗ
	               |	&ТаблицаРемонтовОборудования КАК ТаблицаРемонтовОборудования
	               |;
	               |
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПредписаний.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаПредписаний.ID КАК ID,
	               |	ТаблицаПредписаний.Описание КАК Описание,
	               |	ТаблицаПредписаний.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	               |	ТаблицаПредписаний.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	               |ПОМЕСТИТЬ ВТ_Предписания
	               |ИЗ
	               |	&ТаблицаПредписаний КАК ТаблицаПредписаний
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ВнешниеОснованияДляРабот.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_ВнешниеОснованияДляРабот.ID КАК ID,
	               |	торо_ВнешниеОснованияДляРабот.Описание КАК Описание,
	               |	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	               |	торо_ВнешниеОснованияДляРабот.Организация КАК Организация,
	               |	торо_ВнешниеОснованияДляРабот.Подразделение КАК Подразделение,
				   |	торо_ВнешниеОснованияДляРабот.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	               |ИЗ
	               |	ВТ_ВнешниеОснованияИзОснований КАК ВТ_ВнешниеОснованияИзОснований
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
	               |		ПО ВТ_ВнешниеОснованияИзОснований.ДокументОснование = торо_ВнешниеОснованияДляРабот.Регистратор
				   |ГДЕ
	               |	торо_ВнешниеОснованияДляРабот.ID В
	               |			(ВЫБРАТЬ
	               |				ВТ_РемонтыОборудования.ID КАК ID
	               |			ИЗ
	               |				ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования)
	               |ОБЪЕДИНИТЬ ВСЕ
	               |ВЫБРАТЬ
	               |	ВТ_Предписания.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВТ_Предписания.ID КАК ID,
	               |	ВТ_Предписания.Описание КАК Описание,
	               |	ВТ_Предписания.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	               |	&Организация,
	               |	&Подразделение,
				   |	ВТ_Предписания.РемонтыОборудования_ID КАК РемонтыОборудования_ID
				   
	               |ИЗ
	               |	ВТ_Предписания КАК ВТ_Предписания";
	
	Запрос.УстановитьПараметр("ТаблицаОснований", ТаблицаОснований);
	Запрос.УстановитьПараметр("ТаблицаРемонтовОборудования", ТаблицаРемонтовОборудования);
	Запрос.УстановитьПараметр("ТаблицаПредписаний", ТаблицаПредписаний);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Движения по регистру "Внешние основания для работ", простановка Обработано = Истина
Процедура ДвиженияПоРегистру_торо_ВнешниеОснованияДляРабот(РежимПроведения, ТаблицаВО, Отказ)
	
	Движения.торо_ВнешниеОснованияДляРабот.Очистить();
	Движения.торо_ВнешниеОснованияДляРабот.Записывать = Истина;
	Для каждого ВнешнееОснование Из ТаблицаВО Цикл
		Движение = Движения.торо_ВнешниеОснованияДляРабот.Добавить();
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.ОбъектРемонта = ВнешнееОснование.ОбъектРемонта;
		Движение.ID = ВнешнееОснование.ID;
		Движение.Описание = ВнешнееОснование.Описание;
		Движение.ПлановаяДатаРемонта = ВнешнееОснование.ПлановаяДатаРемонта;
		Движение.Обработано = Истина;
		Движение.Организация = ВнешнееОснование.Организация;
		Движение.Подразделение = ВнешнееОснование.Подразделение;
		Движение.РемонтыОборудования_id = ВнешнееОснование.РемонтыОборудования_id;
	КонецЦикла; 	
КонецПроцедуры

Процедура ПроверитьДублиИсполнителей(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Исполнители.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	Исполнители.Исполнитель КАК Исполнитель,
	|	Исполнители.УточнениеИсполнителя КАК УточнениеИсполнителя,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ВТ_Исполнители
	|ИЗ
	|	&Исполнители КАК Исполнители
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Исполнители.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_Исполнители.Исполнитель КАК Исполнитель,
	|	ВТ_Исполнители.УточнениеИсполнителя КАК УточнениеИсполнителя,
	|	СУММА(ВТ_Исполнители.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ДублиИсполнителей
	|ИЗ
	|	ВТ_Исполнители КАК ВТ_Исполнители
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Исполнители.РемонтыОборудования_ID,
	|	ВТ_Исполнители.Исполнитель,
	|	ВТ_Исполнители.УточнениеИсполнителя
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Исполнители.Количество) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РемонтыОборудования.ID КАК ID,
	|	РемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта
	|ПОМЕСТИТЬ ВТ_РемонтыОборудования
	|ИЗ
	|	&РемонтыОборудования КАК РемонтыОборудования
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ДублиИсполнителей.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ДублиИсполнителей.Исполнитель КАК Исполнитель,
	|	ВТ_ДублиИсполнителей.УточнениеИсполнителя КАК УточнениеИсполнителя,
	|	РемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта
	|ИЗ
	|	ВТ_ДублиИсполнителей КАК ВТ_ДублиИсполнителей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтыОборудования КАК РемонтыОборудования
	|		ПО ВТ_ДублиИсполнителей.РемонтыОборудования_ID = РемонтыОборудования.ID";
	
	Запрос.УстановитьПараметр("Исполнители", ИсполнителиПоРемонтам.Выгрузить());
	Запрос.УстановитьПараметр("РемонтыОборудования", РемонтыОборудования.Выгрузить());
	
	ШаблонСообщения = НСтр("es='Para la reparación ""%1"" es duplicado el ejecutor ""%2"" (""%3"").';ru='Для ремонта ""%1"" дублируется исполнитель ""%2"" (""%3"").';en='For repair ""%1"", the executor ""%2"" (""%3"") is duplicated.'");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ОбъектРемонта, Выборка.Исполнитель, Выборка.УточнениеИсполнителя);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
